Autodesk.Revit.DB.IFCPropertyMappingInfo.IsValidMappingInfo(Autodesk.Revit.DB.IFCPropertyMappingInfo)
Defines whether the mapping info contains meaningful data.
mappingInfo:
The mapping info
Returns:
Whether or not the mapping info is valid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.IFCPropertyMappingInfo.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.IFCPropertyMappingInfo.ExportFlag
Whether or not the property is included in export.
Since:
2026

Autodesk.Revit.DB.IFCPropertyMappingInfo.RevitPropertyName
The Revit property name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.IFCPropertyMappingInfo.RevitPropertyId
The Revit property id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.IFCPropertyMappingInfo.IFCPropertyName
The IFC property name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.IFCPropertyMappingInfo.#ctor(System.Boolean,System.String,Autodesk.Revit.DB.ElementId,System.String)
Constructs a new IFCPropertyMappingInfo with input values.
The flag that indicates whether the property is included in export.
The property name.
The Revit property id.
The Revit property name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.IFCPropertyMappingInfo.#ctor
Constructs a new IFCPropertyMappingInfo with default values.
Since:
2026

Autodesk.Revit.DB.IFCPropertyMappingInfo
Represents the IFC property mapping information stored in the template.
Since:
2026